NACA-2412 AirFoil-OPENFOAM/NACA/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\				
| =========                 |                                                 |				
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |				
|  \\    /   O peration     | Files are generated by Thien Phan               |				
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |				
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 |				
\*---------------------------------------------------------------------------*/				
FoamFile				
{				
    version     2.0;				
    format      ascii;				
    class       dictionary;				
    object      blockMeshDict;				
}				
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //				
convertToMeters	1	;		
				
geometry				
{				
}				

vertices								
(								
	(	0	0	0	)	//	0	
	(	1	0	0	)	//	1	
	(	1	12	0	)	//	2	
	(	-11	0	0	)	//	3	
	(	0	0	0.3	)	//	4	
	(	1	0	0.3	)	//	5	
	(	1	12	0.3	)	//	6	
	(	-11	0	0.3	)	//	7	
	(	21	0	0	)	//	8	
	(	21	12	0	)	//	9	
	(	21	0	0.3	)	//	10	
	(	21	12	0.3	)	//	11	
	(	1	-12	0	)	//	12	
	(	1	-12	0.3	)	//	13	
	(	21	-12	0	)	//	14	
	(	21	-12	0.3	)	//	15	
	(	1	0	0	)	//	16	
	(	1	0	0.3	)	//	17	
								
);								

blocks																
(																
	hex	(0	1	2	3	4	5	6	7)	(	41	48	1	)	//block	1

	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	(															
(	0.4	0.512195122	3.5	)												
(	0.6	0.487804878	0.857142857	)												
	)															
	0.03	0.03														
	(															
(	0.4	0.512195122	3.5	)												
(	0.6	0.487804878	0.857142857	)												
	)															
	//	y-direction	expansion	ratio												
	(															
(	0.041666667	0.354166667	22.18611107	)												
(	0.958333333	0.645833333	9.014648822	)												
	)															
	(															
(	0.041666667	0.354166667	22.18611107	)												
(	0.958333333	0.645833333	9.014648822	)												
	)															
	(															
(	0.041666667	0.354166667	22.18611107	)												
(	0.958333333	0.645833333	9.014648822	)												
	)															
	(															
(	0.041666667	0.354166667	22.18611107	)												
(	0.958333333	0.645833333	9.014648822	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(1	8	9	2	5	10	11	6)	(	74	48	1)	//block	2	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.33333333	33.33333333	33.33333333	33.33333333												
	//	y-direction	expansion	ratio												
	(															
(	0.041666667	0.354166667	22.18611107	)												
(	0.958333333	0.645833333	9.014648822	)												
	)															
	13.95816592	13.95816592														
	(															
(	0.041666667	0.354166667	22.18611107	)												
(	0.958333333	0.645833333	9.014648822	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(3	12	16	0	7	13	17	4)	(	41	48	1	)	//block	3
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	0.03															
	(															
(	0.4	0.512195122	3.5	)												
(	0.6	0.487804878	0.857142857	)												
	)															
	(															
(	0.4	0.512195122	3.5	)												
(	0.6	0.487804878	0.857142857	)												
	)															
	0.03															
	//	y-direction	expansion	ratio												
	(															
(	0.958333333	0.645833333	0.110930555	)												
(	0.041666667	0.354166667	0.045073244	)												
	)															
	(															
(	0.958333333	0.645833333	0.110930555	)												
(	0.041666667	0.354166667	0.045073244	)												
	)															
	(															
(	0.958333333	0.645833333	0.110930555	)												
(	0.041666667	0.354166667	0.045073244	)												
	)															
	(															
(	0.958333333	0.645833333	0.110930555	)												
(	0.041666667	0.354166667	0.045073244	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
																
																
																
																
	hex	(12	14	8	16	13	15	10	17)	(	74	48	1)	//block	4	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.33333333	33.33333333	33.33333333	33.33333333												
	//	y-direction	expansion	ratio												
	(															
(	0.958333333	0.645833333	0.110930555	)												
(	0.041666667	0.354166667	0.045073244	)												
	)															
	0.07164265	0.07164265														
	(															
(	0.958333333	0.645833333	0.110930555	)												
(	0.041666667	0.354166667	0.045073244	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
);																
																
																
edges																
(																
	arc	3 2	(	-7.485281374	8.485281374	0	)									
	arc	7 6	(	-7.485281374	8.485281374	0.3	)									
																
	spline	1	0													
	(															
	(	0.999023	0.000209	0	)											
	(	0.996095	0.000832	0	)											
	(	0.991228	0.001863	0	)											
	(	0.984438	0.003289	0	)											
	(	0.975752	0.005092	0	)											
	(	0.965201	0.007252	0	)											
	(	0.952825	0.009744	0	)											
	(	0.938669	0.012538	0	)											
	(	0.922788	0.015605	0	)											
	(	0.90524	0.01891	0	)											
	(	0.886092	0.022419	0	)											
	(	0.865417	0.026096	0	)											
	(	0.843294	0.029903	0	)											
	(	0.819807	0.033804	0	)											
	(	0.795047	0.03776	0	)											
	(	0.769109	0.041734	0	)											
	(	0.742094	0.045689	0	)											
	(	0.714107	0.049588	0	)											
	(	0.685258	0.053394	0	)											
	(	0.655659	0.057071	0	)											
	(	0.625426	0.060584	0	)											
	(	0.59468	0.063897	0	)											
	(	0.563542	0.066977	0	)											
	(	0.532136	0.069789	0	)											
	(	0.500587	0.072303	0	)											
	(	0.469022	0.074486	0	)											
	(	0.437567	0.076312	0	)											
	(	0.40635	0.077752	0	)											
	(	0.375297	0.078743	0	)											
	(	0.34468	0.07918	0	)											
	(	0.314678	0.079051	0	)											
	(	0.285418	0.078355	0	)											
	(	0.257025	0.077096	0	)											
	(	0.229618	0.075287	0	)											
	(	0.203313	0.072945	0	)											
	(	0.178222	0.070096	0	)											
	(	0.154449	0.06677	0	)											
	(	0.132094	0.063005	0	)											
	(	0.111248	0.058842	0	)											
	(	0.091996	0.054325	0	)											
	(	0.074415	0.049504	0	)											
	(	0.058573	0.044427	0	)											
	(	0.044532	0.039144	0	)											
	(	0.032343	0.033704	0	)											
	(	0.022051	0.028152	0	)											
	(	0.013692	0.022531	0	)											
	(	0.007292	0.016878	0	)											
	(	0.00287	0.011224	0	)											
	(	0.000439	0.005592	0	)											
	)															
																
																
	spline	5	4													
	(															
	(	0.999023	0.000209	0.3	)											
	(	0.996095	0.000832	0.3	)											
	(	0.991228	0.001863	0.3	)											
	(	0.984438	0.003289	0.3	)											
	(	0.975752	0.005092	0.3	)											
	(	0.965201	0.007252	0.3	)											
	(	0.952825	0.009744	0.3	)											
	(	0.938669	0.012538	0.3	)											
	(	0.922788	0.015605	0.3	)											
	(	0.90524	0.01891	0.3	)											
	(	0.886092	0.022419	0.3	)											
	(	0.865417	0.026096	0.3	)											
	(	0.843294	0.029903	0.3	)											
	(	0.819807	0.033804	0.3	)											
	(	0.795047	0.03776	0.3	)											
	(	0.769109	0.041734	0.3	)											
	(	0.742094	0.045689	0.3	)											
	(	0.714107	0.049588	0.3	)											
	(	0.685258	0.053394	0.3	)											
	(	0.655659	0.057071	0.3	)											
	(	0.625426	0.060584	0.3	)											
	(	0.59468	0.063897	0.3	)											
	(	0.563542	0.066977	0.3	)											
	(	0.532136	0.069789	0.3	)											
	(	0.500587	0.072303	0.3	)											
	(	0.469022	0.074486	0.3	)											
	(	0.437567	0.076312	0.3	)											
	(	0.40635	0.077752	0.3	)											
	(	0.375297	0.078743	0.3	)											
	(	0.34468	0.07918	0.3	)											
	(	0.314678	0.079051	0.3	)											
	(	0.285418	0.078355	0.3	)											
	(	0.257025	0.077096	0.3	)											
	(	0.229618	0.075287	0.3	)											
	(	0.203313	0.072945	0.3	)											
	(	0.178222	0.070096	0.3	)											
	(	0.154449	0.06677	0.3	)											
	(	0.132094	0.063005	0.3	)											
	(	0.111248	0.058842	0.3	)											
	(	0.091996	0.054325	0.3	)											
	(	0.074415	0.049504	0.3	)											
	(	0.058573	0.044427	0.3	)											
	(	0.044532	0.039144	0.3	)											
	(	0.032343	0.033704	0.3	)											
	(	0.022051	0.028152	0.3	)											
	(	0.013692	0.022531	0.3	)											
	(	0.007292	0.016878	0.3	)											
	(	0.00287	0.011224	0.3	)											
	(	0.000439	0.005592	0.3	)											
	)															
																
																
	arc	3 12	(	-7.485281374	-8.485281374	0	)									
	arc	7 13	(	-7.485281374	-8.485281374	0.3	)									
																
	spline	0	16													
	(															
	(	0.001535	-0.005395	0	)											
	(	0.005015	-0.010439	0	)											
	(	0.010421	-0.015126	0	)											
	(	0.017725	-0.019451	0	)											
	(	0.026892	-0.023408	0	)											
	(	0.03788	-0.02699	0	)											
	(	0.050641	-0.030193	0	)											
	(	0.06512	-0.033014	0	)											
	(	0.081257	-0.035451	0	)											
	(	0.098987	-0.037507	0	)											
	(	0.118239	-0.039185	0	)											
	(	0.138937	-0.040493	0	)											
	(	0.161004	-0.041444	0	)											
	(	0.184354	-0.042054	0	)											
	(	0.208902	-0.042343	0	)											
	(	0.234555	-0.042335	0	)											
	(	0.261221	-0.042058	0	)											
	(	0.288802	-0.041541	0	)											
	(	0.317197	-0.040817	0	)											
	(	0.346303	-0.039923	0	)											
	(	0.376013	-0.038892	0	)											
	(	0.406269	-0.037757	0	)											
	(	0.437099	-0.036467	0	)											
	(	0.468187	-0.035009	0	)											
	(	0.499413	-0.033414	0	)											
	(	0.530654	-0.031708	0	)											
	(	0.561791	-0.029917	0	)											
	(	0.592701	-0.028066	0	)											
	(	0.623264	-0.026176	0	)											
	(	0.653358	-0.024269	0	)											
	(	0.682867	-0.02236	0	)											
	(	0.711672	-0.020466	0	)											
	(	0.739659	-0.0186	0	)											
	(	0.766718	-0.016774	0	)											
	(	0.792738	-0.014999	0	)											
	(	0.817617	-0.013284	0	)											
	(	0.841253	-0.011637	0	)											
	(	0.863551	-0.010068	0	)											
	(	0.884421	-0.008583	0	)											
	(	0.903777	-0.007191	0	)											
	(	0.92154	-0.0059	0	)											
	(	0.937637	-0.004717	0	)											
	(	0.952002	-0.00365	0	)											
	(	0.964576	-0.002708	0	)											
	(	0.975305	-0.001896	0	)											
	(	0.984145	-0.001222	0	)											
	(	0.99106	-0.000691	0	)											
	(	0.99602	-0.000308	0	)											
	(	0.999004	-0.000077	0	)											
	)															
																
																
	spline	4	17													
	(															
	(	0.001535	-0.005395	0.3	)											
	(	0.005015	-0.010439	0.3	)											
	(	0.010421	-0.015126	0.3	)											
	(	0.017725	-0.019451	0.3	)											
	(	0.026892	-0.023408	0.3	)											
	(	0.03788	-0.02699	0.3	)											
	(	0.050641	-0.030193	0.3	)											
	(	0.06512	-0.033014	0.3	)											
	(	0.081257	-0.035451	0.3	)											
	(	0.098987	-0.037507	0.3	)											
	(	0.118239	-0.039185	0.3	)											
	(	0.138937	-0.040493	0.3	)											
	(	0.161004	-0.041444	0.3	)											
	(	0.184354	-0.042054	0.3	)											
	(	0.208902	-0.042343	0.3	)											
	(	0.234555	-0.042335	0.3	)											
	(	0.261221	-0.042058	0.3	)											
	(	0.288802	-0.041541	0.3	)											
	(	0.317197	-0.040817	0.3	)											
	(	0.346303	-0.039923	0.3	)											
	(	0.376013	-0.038892	0.3	)											
	(	0.406269	-0.037757	0.3	)											
	(	0.437099	-0.036467	0.3	)											
	(	0.468187	-0.035009	0.3	)											
	(	0.499413	-0.033414	0.3	)											
	(	0.530654	-0.031708	0.3	)											
	(	0.561791	-0.029917	0.3	)											
	(	0.592701	-0.028066	0.3	)											
	(	0.623264	-0.026176	0.3	)											
	(	0.653358	-0.024269	0.3	)											
	(	0.682867	-0.02236	0.3	)											
	(	0.711672	-0.020466	0.3	)											
	(	0.739659	-0.0186	0.3	)											
	(	0.766718	-0.016774	0.3	)											
	(	0.792738	-0.014999	0.3	)											
	(	0.817617	-0.013284	0.3	)											
	(	0.841253	-0.011637	0.3	)											
	(	0.863551	-0.010068	0.3	)											
	(	0.884421	-0.008583	0.3	)											
	(	0.903777	-0.007191	0.3	)											
	(	0.92154	-0.0059	0.3	)											
	(	0.937637	-0.004717	0.3	)											
	(	0.952002	-0.00365	0.3	)											
	(	0.964576	-0.002708	0.3	)											
	(	0.975305	-0.001896	0.3	)											
	(	0.984145	-0.001222	0.3	)											
	(	0.99106	-0.000691	0.3	)											
	(	0.99602	-0.000308	0.3	)											
	(	0.999004	-0.000077	0.3	)											
	)															
																
																
);																
																
faces																
(																
																
);																
																
faces																
(																
  																
);																
																
																
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}																
boundary		
(		
inlet              // patch name		
        {		
            type patch; 		
            faces		
            (		
                (9 2 6 11)  		
                (2 3 7 6  )  		
                (3 12 13 7  )		
                (12 15 14 13  )		
            );		
        }		
		
outlet              // patch name		
        {		
            type patch;    		
            faces		
            (		
                (8 9 10 11)  		
                (15 8 10 14  ) 		
            );		
        }		
		
walls              // patch name		
        {		
            type wall; 		
            faces		
            (		
                (0 1 5 4)  		
                (0 4 17 16  ) 		
            );		
        }		
		
interface1              // patch name		
        {		
            type patch;   		
            faces		
            (		
                (1 8 10 5)  		
            );		
        }		
interface2              // patch name		
        {		
            type patch;    		
            faces		
            (		
                (16 17 10 8)  		
            );		
        }		
);		
		
 mergePatchPairs		
(		
    ( interface1 interface2 )		
);		

